src/Catalogs/ПрофилиКлючевыхОпераций/ПрофилиКлючевыхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофилиКлючевыхОпераций</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>ПреобразоватьИмя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеОперацииПрофиля</name>
    <attributes>
      <name>КлючеваяОперация</name>
      <type>
        <types>CatalogRef.КлючевыеОперацииЦентрМониторинга</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелевоеВремя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Важность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоиск</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимальноеКоличествоЗамеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ПрофилиКлючевыхОпераций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Процедура ДобавитьВременнуюТаблицуКлючевыхОпераций(Ссылка, Запрос, ИмяВременнойТаблицы) Экспорт
    
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ
	|	ПрофилиКлючевыхОперацийКлючевыеОперацииПрофиля.НомерСтроки КАК НомерСтроки,
	|	ПрофилиКлючевыхОперацийКлючевыеОперацииПрофиля.ИмяПоиск КАК ИмяПоиск,
	|	ПрофилиКлючевыхОперацийКлючевыеОперацииПрофиля.ИмяПредставление КАК ИмяПредставление,
	|	ПрофилиКлючевыхОперацийКлючевыеОперацииПрофиля.ЦелевоеВремя КАК ЦелевоеВремя,
	|	ПрофилиКлючевыхОперацийКлючевыеОперацииПрофиля.МинимальноеКоличествоЗамеров КАК МинимальноеКоличествоЗамеров,
	|	ПрофилиКлючевыхОперацийКлючевыеОперацииПрофиля.Важность КАК Важность,
	|	ПрофилиКлючевыхОперацийКлючевыеОперацииПрофиля.Ответственный КАК Ответственный
	|ПОМЕСТИТЬ ВТ_Профиль
	|ИЗ
	|	Справочник.ПрофилиКлючевыхОпераций.КлючевыеОперацииПрофиля КАК ПрофилиКлючевыхОперацийКлючевыеОперацииПрофиля
	|ГДЕ
	|	ПрофилиКлючевыхОперацийКлючевыеОперацииПрофиля.Ссылка = &ПрофильКлючевыхОпераций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Профиль.НомерСтроки КАК НомерСтроки,
	|	ВТ_Профиль.ИмяПоиск КАК ИмяПоиск,
	|	ВТ_Профиль.ИмяПредставление КАК ИмяПредставление,
	|	ВТ_Профиль.ЦелевоеВремя КАК ЦелевоеВремя,
	|	ВТ_Профиль.МинимальноеКоличествоЗамеров КАК МинимальноеКоличествоЗамеров,
	|	ВТ_Профиль.Важность КАК Важность,
	|	ВТ_Профиль.Ответственный КАК Ответственный,
	|	ВЫБОР
	|		КОГДА ВТ_Профиль.ИмяПоиск ПОДОБНО ""\%%\%"" СПЕЦСИМВОЛ ""\""
	|			ТОГДА ""СлеваСправа""
	|		КОГДА ВТ_Профиль.ИмяПоиск ПОДОБНО ""%\%%"" СПЕЦСИМВОЛ ""\""
	|			ТОГДА ""ВСередине""
	|		КОГДА ВТ_Профиль.ИмяПоиск ПОДОБНО ""\%%"" СПЕЦСИМВОЛ ""\""
	|			ТОГДА ""Слева""
	|		КОГДА ВТ_Профиль.ИмяПоиск ПОДОБНО ""%\%"" СПЕЦСИМВОЛ ""\""
	|			ТОГДА ""Справа""
	|		ИНАЧЕ ""ПолноеСоотвествие""
	|	КОНЕЦ КАК ВидПоиска
	|ПОМЕСТИТЬ ВТ_ПрофильСВидомПоиска
	|ИЗ
	|	ВТ_Профиль КАК ВТ_Профиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПрофильСВидомПоиска.НомерСтроки КАК НомерСтроки,
	|	ВТ_ПрофильСВидомПоиска.ИмяПоиск КАК ИмяПоиск,
	|	ВТ_ПрофильСВидомПоиска.ИмяПредставление КАК ИмяПредставление,
	|	КлючевыеОперацииЦентрМониторинга.Наименование,
	|	ВТ_ПрофильСВидомПоиска.ЦелевоеВремя КАК ЦелевоеВремя,
	|	ВТ_ПрофильСВидомПоиска.МинимальноеКоличествоЗамеров КАК МинимальноеКоличествоЗамеров,
	|	ВТ_ПрофильСВидомПоиска.Важность КАК Важность,
	|	ВТ_ПрофильСВидомПоиска.Ответственный КАК Ответственный,
	|	ВТ_ПрофильСВидомПоиска.ВидПоиска КАК ВидПоиска,
	|	КлючевыеОперацииЦентрМониторинга.Ссылка КАК КлючеваяОперация,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПолнаяТаблицаКлючевыхОпераий
	|ИЗ
	|	ВТ_ПрофильСВидомПоиска КАК ВТ_ПрофильСВидомПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючевыеОперацииЦентрМониторинга КАК КлючевыеОперацииЦентрМониторинга
	|		ПО ВТ_ПрофильСВидомПоиска.ИмяПоиск = КлючевыеОперацииЦентрМониторинга.Наименование
	|ГДЕ
	|	ВТ_ПрофильСВидомПоиска.ВидПоиска = ""ПолноеСоотвествие""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПрофильСВидомПоиска.НомерСтроки,
	|	ВТ_ПрофильСВидомПоиска.ИмяПоиск,
	|	ВТ_ПрофильСВидомПоиска.ИмяПредставление,
	|	КлючевыеОперацииЦентрМониторинга.Наименование,
	|	ВТ_ПрофильСВидомПоиска.ЦелевоеВремя,
	|	ВТ_ПрофильСВидомПоиска.МинимальноеКоличествоЗамеров КАК МинимальноеКоличествоЗамеров,
	|	ВТ_ПрофильСВидомПоиска.Важность,
	|	ВТ_ПрофильСВидомПоиска.Ответственный,
	|	ВТ_ПрофильСВидомПоиска.ВидПоиска,
	|	КлючевыеОперацииЦентрМониторинга.Ссылка,
	|	2
	|ИЗ
	|	ВТ_ПрофильСВидомПоиска КАК ВТ_ПрофильСВидомПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючевыеОперацииЦентрМониторинга КАК КлючевыеОперацииЦентрМониторинга
	|		ПО (КлючевыеОперацииЦентрМониторинга.Наименование ПОДОБНО ВТ_ПрофильСВидомПоиска.ИмяПоиск)
	|ГДЕ
	|	ВТ_ПрофильСВидомПоиска.ВидПоиска = ""ВСередине""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПрофильСВидомПоиска.НомерСтроки,
	|	ВТ_ПрофильСВидомПоиска.ИмяПоиск,
	|	ВТ_ПрофильСВидомПоиска.ИмяПредставление,
	|	КлючевыеОперацииЦентрМониторинга.Наименование,
	|	ВТ_ПрофильСВидомПоиска.ЦелевоеВремя,
	|	ВТ_ПрофильСВидомПоиска.МинимальноеКоличествоЗамеров КАК МинимальноеКоличествоЗамеров,
	|	ВТ_ПрофильСВидомПоиска.Важность,
	|	ВТ_ПрофильСВидомПоиска.Ответственный,
	|	ВТ_ПрофильСВидомПоиска.ВидПоиска,
	|	КлючевыеОперацииЦентрМониторинга.Ссылка,
	|	3
	|ИЗ
	|	ВТ_ПрофильСВидомПоиска КАК ВТ_ПрофильСВидомПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючевыеОперацииЦентрМониторинга КАК КлючевыеОперацииЦентрМониторинга
	|		ПО (КлючевыеОперацииЦентрМониторинга.Наименование ПОДОБНО ВТ_ПрофильСВидомПоиска.ИмяПоиск)
	|ГДЕ
	|	ВТ_ПрофильСВидомПоиска.ВидПоиска = ""Справа""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПрофильСВидомПоиска.НомерСтроки,
	|	ВТ_ПрофильСВидомПоиска.ИмяПоиск,
	|	ВТ_ПрофильСВидомПоиска.ИмяПредставление,
	|	КлючевыеОперацииЦентрМониторинга.Наименование,
	|	ВТ_ПрофильСВидомПоиска.ЦелевоеВремя,
	|	ВТ_ПрофильСВидомПоиска.МинимальноеКоличествоЗамеров КАК МинимальноеКоличествоЗамеров,
	|	ВТ_ПрофильСВидомПоиска.Важность,
	|	ВТ_ПрофильСВидомПоиска.Ответственный,
	|	ВТ_ПрофильСВидомПоиска.ВидПоиска,
	|	КлючевыеОперацииЦентрМониторинга.Ссылка,
	|	4
	|ИЗ
	|	ВТ_ПрофильСВидомПоиска КАК ВТ_ПрофильСВидомПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючевыеОперацииЦентрМониторинга КАК КлючевыеОперацииЦентрМониторинга
	|		ПО (КлючевыеОперацииЦентрМониторинга.Наименование ПОДОБНО ВТ_ПрофильСВидомПоиска.ИмяПоиск)
	|ГДЕ
	|	ВТ_ПрофильСВидомПоиска.ВидПоиска = ""Слева""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПрофильСВидомПоиска.НомерСтроки,
	|	ВТ_ПрофильСВидомПоиска.ИмяПоиск,
	|	ВТ_ПрофильСВидомПоиска.ИмяПредставление,
	|	КлючевыеОперацииЦентрМониторинга.Наименование,
	|	ВТ_ПрофильСВидомПоиска.ЦелевоеВремя,
	|	ВТ_ПрофильСВидомПоиска.МинимальноеКоличествоЗамеров КАК МинимальноеКоличествоЗамеров,
	|	ВТ_ПрофильСВидомПоиска.Важность,
	|	ВТ_ПрофильСВидомПоиска.Ответственный,
	|	ВТ_ПрофильСВидомПоиска.ВидПоиска,
	|	КлючевыеОперацииЦентрМониторинга.Ссылка,
	|	5
	|ИЗ
	|	ВТ_ПрофильСВидомПоиска КАК ВТ_ПрофильСВидомПоиска
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючевыеОперацииЦентрМониторинга КАК КлючевыеОперацииЦентрМониторинга
	|		ПО (КлючевыеОперацииЦентрМониторинга.Наименование ПОДОБНО ВТ_ПрофильСВидомПоиска.ИмяПоиск)
	|ГДЕ
	|	ВТ_ПрофильСВидомПоиска.ВидПоиска = ""СлеваСправа""
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючеваяОперация,
	|	Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолнаяТаблицаКлючевыхОпераий.КлючеваяОперация КАК КлючеваяОперация,
	|	МИНИМУМ(ВТ_ПолнаяТаблицаКлючевыхОпераий.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_ПриоритезированиеКО
	|ИЗ
	|	ВТ_ПолнаяТаблицаКлючевыхОпераий КАК ВТ_ПолнаяТаблицаКлючевыхОпераий
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПолнаяТаблицаКлючевыхОпераий.КлючеваяОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПолнаяТаблицаКлючевыхОпераий.КлючеваяОперация КАК КлючеваяОперация,
	|	ВТ_ПолнаяТаблицаКлючевыхОпераий.ИмяПредставление КАК ИмяПредставление,
	|	ВТ_ПолнаяТаблицаКлючевыхОпераий.Наименование КАК Наименование,
	|	ВТ_ПолнаяТаблицаКлючевыхОпераий.ЦелевоеВремя КАК ЦелевоеВремя,
	|	ВТ_ПолнаяТаблицаКлючевыхОпераий.Важность КАК Важность,
	|	ВТ_ПолнаяТаблицаКлючевыхОпераий.МинимальноеКоличествоЗамеров КАК МинимальноеКоличествоЗамеров,
	|	ВТ_ПолнаяТаблицаКлючевыхОпераий.Ответственный КАК Ответственный
	|ПОМЕСТИТЬ " + ИмяВременнойТаблицы + "
	|ИЗ
	|	ВТ_ПриоритезированиеКО КАК ВТ_ПриоритезированиеКО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПолнаяТаблицаКлючевыхОпераий КАК ВТ_ПолнаяТаблицаКлючевыхОпераий
	|		ПО ВТ_ПриоритезированиеКО.КлючеваяОперация = ВТ_ПолнаяТаблицаКлючевыхОпераий.КлючеваяОперация
	|			И ВТ_ПриоритезированиеКО.Приоритет = ВТ_ПолнаяТаблицаКлючевыхОпераий.Приоритет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючеваяОперация
	|;";
	
	Запрос.УстановитьПараметр("ПрофильКлючевыхОпераций", Ссылка); 
        
КонецПроцедуры

#КонецОбласти

#КонецЕсли
